nxp-mcuxpresso/mcux-devices-mcx/MCXN/MCXN536/iar/startup_MCXN536_cm33_core1.s
        PUBWEAK HSCMP1_IRQHandler
        PUBWEAK HSCMP1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
HSCMP1_IRQHandler
        LDR     R0, =HSCMP1_DriverIRQHandler
        BX      R0

        PUBWEAK HSCMP2_IRQHandler
        PUBWEAK HSCMP2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
HSCMP2_IRQHandler
        LDR     R0, =HSCMP2_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM0_RELOAD_ERROR_IRQHandler
        PUBWEAK FLEXPWM0_RELOAD_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM0_RELOAD_ERROR_IRQHandler
        LDR     R0, =FLEXPWM0_RELOAD_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM0_FAULT_IRQHandler
        PUBWEAK FLEXPWM0_FAULT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM0_FAULT_IRQHandler
        LDR     R0, =FLEXPWM0_FAULT_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM0_SUBMODULE0_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM0_SUBMODULE0_IRQHandler
        LDR     R0, =FLEXPWM0_SUBMODULE0_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM0_SUBMODULE1_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM0_SUBMODULE1_IRQHandler
        LDR     R0, =FLEXPWM0_SUBMODULE1_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM0_SUBMODULE2_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM0_SUBMODULE2_IRQHandler
        LDR     R0, =FLEXPWM0_SUBMODULE2_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM0_SUBMODULE3_IRQHandler
        PUBWEAK FLEXPWM0_SUBMODULE3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM0_SUBMODULE3_IRQHandler
        LDR     R0, =FLEXPWM0_SUBMODULE3_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved134_IRQHandler
        PUBWEAK Reserved134_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved134_IRQHandler
        LDR     R0, =Reserved134_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved135_IRQHandler
        PUBWEAK Reserved135_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved135_IRQHandler
        LDR     R0, =Reserved135_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved136_IRQHandler
        PUBWEAK Reserved136_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved136_IRQHandler
        LDR     R0, =Reserved136_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved137_IRQHandler
        PUBWEAK Reserved137_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved137_IRQHandler
        LDR     R0, =Reserved137_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved138_IRQHandler
        PUBWEAK Reserved138_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved138_IRQHandler
        LDR     R0, =Reserved138_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved139_IRQHandler
        PUBWEAK Reserved139_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved139_IRQHandler
        LDR     R0, =Reserved139_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved140_IRQHandler
        PUBWEAK Reserved140_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved140_IRQHandler
        LDR     R0, =Reserved140_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved141_IRQHandler
        PUBWEAK Reserved141_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved141_IRQHandler
        LDR     R0, =Reserved141_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved142_IRQHandler
        PUBWEAK Reserved142_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved142_IRQHandler
        LDR     R0, =Reserved142_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved143_IRQHandler
        PUBWEAK Reserved143_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved143_IRQHandler
        LDR     R0, =Reserved143_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved144_IRQHandler
        PUBWEAK Reserved144_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved144_IRQHandler
        LDR     R0, =Reserved144_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved145_IRQHandler
        PUBWEAK Reserved145_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved145_IRQHandler
        LDR     R0, =Reserved145_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved146_IRQHandler
        PUBWEAK Reserved146_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved146_IRQHandler
        LDR     R0, =Reserved146_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved147_IRQHandler
        PUBWEAK Reserved147_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved147_IRQHandler
        LDR     R0, =Reserved147_DriverIRQHandler
        BX      R0

        PUBWEAK ITRC0_IRQHandler
        PUBWEAK ITRC0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ITRC0_IRQHandler
        LDR     R0, =ITRC0_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved149_IRQHandler
        PUBWEAK Reserved149_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved149_IRQHandler
        LDR     R0, =Reserved149_DriverIRQHandler
        BX      R0

        PUBWEAK ELS_ERR_IRQHandler
        PUBWEAK ELS_ERR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ELS_ERR_IRQHandler
        LDR     R0, =ELS_ERR_DriverIRQHandler
        BX      R0

        PUBWEAK PKC_ERR_IRQHandler
        PUBWEAK PKC_ERR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PKC_ERR_IRQHandler
        LDR     R0, =PKC_ERR_DriverIRQHandler
        BX      R0

        PUBWEAK ERM_SINGLE_BIT_ERROR_IRQHandler
        PUBWEAK ERM_SINGLE_BIT_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ERM_SINGLE_BIT_ERROR_IRQHandler
        LDR     R0, =ERM_SINGLE_BIT_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK ERM_MULTI_BIT_ERROR_IRQHandler
        PUBWEAK ERM_MULTI_BIT_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ERM_MULTI_BIT_ERROR_IRQHandler
        LDR     R0, =ERM_MULTI_BIT_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK FMU0_IRQHandler
        PUBWEAK FMU0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FMU0_IRQHandler
        LDR     R0, =FMU0_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved155_IRQHandler
        PUBWEAK Reserved155_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved155_IRQHandler
        LDR     R0, =Reserved155_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved156_IRQHandler
        PUBWEAK Reserved156_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved156_IRQHandler
        LDR     R0, =Reserved156_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved157_IRQHandler
        PUBWEAK Reserved157_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved157_IRQHandler
        LDR     R0, =Reserved157_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved158_IRQHandler
        PUBWEAK Reserved158_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved158_IRQHandler
        LDR     R0, =Reserved158_DriverIRQHandler
        BX      R0

